In [33]:
import mysql.connector as sql

# ESTABLISHED A CONNECTION

In [19]:
connection = sql.connect(host="localhost",port='3307', user="root", password="aditya@1", database="adityadb")

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000249F5D50388>

In [20]:
cursor = connection.cursor()

# SELECT QUERY

In [21]:
cursor.execute("SELECT * FROM worker")

myresult = cursor.fetchall()

for x in myresult:
    print(x)

(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')
(2, 'Niharika', 'Verma', 80000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')
(3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')
(4, 'Amitabh', 'Singh', 500000, datetime.datetime(2014, 2, 20, 9, 0), 'Admin')
(5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')
(6, 'Vipul', 'Diwan', 200000, datetime.datetime(2014, 6, 11, 9, 0), 'Account')
(7, 'Satish', 'Kumar', 75000, datetime.datetime(2014, 1, 20, 9, 0), 'Account')
(8, 'Geetika', 'Chauhan', 90000, datetime.datetime(2014, 4, 11, 9, 0), 'Admin')

In [22]:
cursor.execute("SELECT * FROM worker where worker_id=1")

myresult = cursor.fetchall()

for x in myresult:
    print(x)

(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')

# CREATE A DATABASE

In [25]:
mydb = sql.connect(
  host="localhost",
  user="root",
  password="aditya@1",port="3307"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE mydatabase")

In [27]:
mydb = sql.connect(
  host="localhost",
  user="root",
  password="aditya@1",port="3307",database="mydatabase"
)

mycursor = mydb.cursor()

In [28]:
mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

In [30]:
mycursor = mydb.cursor()

sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)
mydb.commit()

In [31]:

mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('John', 'Highway 21')
('John', 'Highway 21')

# ANY OPERATION U WANT CAN BE DONE USING - https://www.w3schools.com/python/python_mysql_getstarted.asp

# PIPELINE 
# IMPORTED FROM EXCEL - MYSQL -PYTHON

In [34]:
connection = sql.connect(host="localhost",port='3307', user="root", password="aditya@1", database="sys")

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x00000249F495AB48>

In [35]:
cursor = connection.cursor()

In [36]:
cursor.execute("SELECT * FROM Alpine")

myresult = cursor.fetchall()

for x in myresult:
    print(x)

('Aditya', 21, 15000)
('Aman', 21, 30000)

In [37]:
import numpy as np
import pandas as pd
data=pd.DataFrame(myresult)

In [38]:
data

        0   1      2
0  Aditya  21  15000
1    Aman  21  30000

In [39]:
data.columns={'Name','Age','salary'}

In [40]:
data

     Name  Age  salary
0  Aditya   21   15000
1    Aman   21   30000